; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)
(:predicates
    (Connected ?j - joint ?l - link) 
    (AngleOrd ?a - angle ?a1 - angle)
    (HasAngle ?a - angle ?j - joint)
    (IsChildOf ?child - link ?parent - link)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
    (IsChildOf ?link1 ?link2)
    (Connected ?joint ?link1)
    (Connected ?joint ?link2)
    (not (= ?link1 ?link2))
    (HasAngle ?a1 ?joint)
    (AngleOrd ?a1 ?a2)
    )
:effect (and 
    (not (HasAngle ?a1 ?joint)) 
    (HasAngle ?a2 ?joint)
    )
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
    (IsChildOf ?link1 ?link2)
    (Connected ?joint ?link1)
    (Connected ?joint ?link2)
    (not (= ?link1 ?link2))
    (HasAngle ?a1 ?joint)
    (AngleOrd ?a2 ?a1)
    )
:effect (and 
    (not (HasAngle ?a1 ?joint)) 
    (HasAngle ?a2 ?joint)
    )
)
)

; problem
(define (problem joint_bar_9)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 - link
    joint_ground joint1 joint2 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (AngleOrd angle0 angle90)
    (AngleOrd angle90 angle180)
    (AngleOrd angle180 angle270)
    (AngleOrd angle270 angle0)

    (IsChildOf link1 link_ground)
    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Connected joint_ground link_ground)
    (Connected joint_ground link1)
    (Connected joint1 link1)
    (Connected joint1 link2)
    (Connected joint2 link2)
    (Connected joint2 link3)

    (HasAngle angle90 joint_ground)
    (HasAngle angle90 joint1)
    (HasAngle angle0 joint2)
)
(:goal
(and
    (HasAngle angle90 joint_ground)
    (HasAngle angle270 joint1)
    (HasAngle angle180 joint2)
    )
)
)

; plan
1. (increase_angle link3 link2 joint2 angle0 angle90)
   deleted: (hasangle angle0 joint2)
   added: (hasangle angle90 joint2)
   goals met: 1 of 3
2. (increase_angle link3 link2 joint2 angle90 angle180)
   deleted: (hasangle angle90 joint2)
   added: (hasangle angle180 joint2)
   goals met: 2 of 3
3. (decrease_angle link2 link1 joint1 angle90 angle0)
   deleted: (hasangle angle90 joint1)
   added: (hasangle angle0 joint1)
   goals met: 2 of 3
4. (decrease_angle link2 link1 joint1 angle0 angle270)
   deleted: (hasangle angle0 joint1)
   added: (hasangle angle270 joint1)
   goals met: 3 of 3
